solidworks.org
#+description: Fonctionnement de l'Innovation Lab
#+author: remi.griot@efrei.fr
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
#+OPTIONS: num:nil

* Instalation
Installation de la version Student Design Kit (SDK) de Solidworks

https://www.visiativ-education-recherche.fr/licences/monde-de-leducation/licence-etudiante-gratuite-sdk/

* Vidéos
Chaque capsule vidéo dure environ 15 minutes. Il est conseillé de faire les manipulations en même temps que le visionnage de la vidéo, ce qui peut vous amener à passer 30 minutes par capsule.

** Introduction
Cette vidéo vous permettra d'avoir un aperçu des différentes étapes lors de la création d'une pièce: https://youtu.be/vZ7OwdcAcxc
** Esquisse 1 
Cette vidéo vous permettra de connaitre les rudiments lors du dessin d'une esquisse (2D) (cotation, relation): https://youtu.be/5jId1YrTWAo
** Esquisse 2
Cette vidéo poursuit l'édition d'esquisse en utilisant des fonctionnalités plus avancés (arc de cercle, relation): https://youtu.be/MkjaaoVj5BI
** Fonction 1
Cette vidéo permet d'appréhender les paramètres des fonctions d'extrusions, de perçage et de congès: https://youtu.be/pQ4-ze1oDSk
** Exemple 
Exemple appliqué de tout les concepts vu précédement: https://youtu.be/teqTepatoRI
** Fonction 2
Cette vidéo vous permet de comprendre les principaux paramètres d'une fonction de répétition linéaire: https://youtu.be/aGtFkHNxHeo
** Fonction 3
Cette vidéo vous permet de comprendre les principaux paramètres d'une fonction de répétition circulaire: https://youtu.be/vTP7yL_E8E8
