solidworks.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-09-21 mer. 15:40 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="remi.griot@efrei.fr" />
<meta name="description" content="Fonctionnement de l'Innovation Lab" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb1bf337">Instalation</a></li>
<li><a href="#org0f1ee36">Vidéos</a>
<ul>
<li><a href="#orga9b24de">Introduction</a></li>
<li><a href="#org7e6e22c">Esquisse 1</a></li>
<li><a href="#orgf6d2c37">Esquisse 2</a></li>
<li><a href="#org06fbe14">Fonction 1</a></li>
<li><a href="#org172c674">Exemple</a></li>
<li><a href="#orgf0e7860">Fonction 2</a></li>
<li><a href="#org82ea2b2">Fonction 3</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgb1bf337" class="outline-2">
<h2 id="orgb1bf337">Instalation</h2>
<div class="outline-text-2" id="text-orgb1bf337">
<p>
Installation de la version Student Design Kit (SDK) de Solidworks
</p>

<p>
<a href="https://www.visiativ-education-recherche.fr/licences/monde-de-leducation/licence-etudiante-gratuite-sdk/">https://www.visiativ-education-recherche.fr/licences/monde-de-leducation/licence-etudiante-gratuite-sdk/</a>
</p>
</div>
</div>

<div id="outline-container-org0f1ee36" class="outline-2">
<h2 id="org0f1ee36">Vidéos</h2>
<div class="outline-text-2" id="text-org0f1ee36">
<p>
Chaque capsule vidéo dure environ 15 minutes. Il est conseillé de faire les manipulations en même temps que le visionnage de la vidéo, ce qui peut vous amener à passer 30 minutes par capsule.
</p>
</div>

<div id="outline-container-orga9b24de" class="outline-3">
<h3 id="orga9b24de">Introduction</h3>
<div class="outline-text-3" id="text-orga9b24de">
<p>
Cette vidéo vous permettra d'avoir un aperçu des différentes étapes lors de la création d'une pièce: <a href="https://youtu.be/vZ7OwdcAcxc">https://youtu.be/vZ7OwdcAcxc</a>
</p>
</div>
</div>
<div id="outline-container-org7e6e22c" class="outline-3">
<h3 id="org7e6e22c">Esquisse 1</h3>
<div class="outline-text-3" id="text-org7e6e22c">
<p>
Cette vidéo vous permettra de connaitre les rudiments lors du dessin d'une esquisse (2D) (cotation, relation): <a href="https://youtu.be/5jId1YrTWAo">https://youtu.be/5jId1YrTWAo</a>
</p>
</div>
</div>
<div id="outline-container-orgf6d2c37" class="outline-3">
<h3 id="orgf6d2c37">Esquisse 2</h3>
<div class="outline-text-3" id="text-orgf6d2c37">
<p>
Cette vidéo poursuit l'édition d'esquisse en utilisant des fonctionnalités plus avancés (arc de cercle, relation): <a href="https://youtu.be/MkjaaoVj5BI">https://youtu.be/MkjaaoVj5BI</a>
</p>
</div>
</div>
<div id="outline-container-org06fbe14" class="outline-3">
<h3 id="org06fbe14">Fonction 1</h3>
<div class="outline-text-3" id="text-org06fbe14">
<p>
Cette vidéo permet d'appréhender les paramètres des fonctions d'extrusions, de perçage et de congès: <a href="https://youtu.be/pQ4-ze1oDSk">https://youtu.be/pQ4-ze1oDSk</a>
</p>
</div>
</div>
<div id="outline-container-org172c674" class="outline-3">
<h3 id="org172c674">Exemple</h3>
<div class="outline-text-3" id="text-org172c674">
<p>
Exemple appliqué de tout les concepts vu précédement: <a href="https://youtu.be/teqTepatoRI">https://youtu.be/teqTepatoRI</a>
</p>
</div>
</div>
<div id="outline-container-orgf0e7860" class="outline-3">
<h3 id="orgf0e7860">Fonction 2</h3>
<div class="outline-text-3" id="text-orgf0e7860">
<p>
Cette vidéo vous permet de comprendre les principaux paramètres d'une fonction de répétition linéaire: <a href="https://youtu.be/aGtFkHNxHeo">https://youtu.be/aGtFkHNxHeo</a>
</p>
</div>
</div>
<div id="outline-container-org82ea2b2" class="outline-3">
<h3 id="org82ea2b2">Fonction 3</h3>
<div class="outline-text-3" id="text-org82ea2b2">
<p>
Cette vidéo vous permet de comprendre les principaux paramètres d'une fonction de répétition circulaire: <a href="https://youtu.be/vTP7yL_E8E8">https://youtu.be/vTP7yL_E8E8</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: remi.griot@efrei.fr</p>
<p class="date">Created: 2022-09-21 mer. 15:40</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
